{
    "version": "https://jsonfeed.org/version/1",
    "title": "Let&#x27;s go &quot;My, my!&quot;",
    "description": "",
    "home_page_url": "https://mymy-us.github.io",
    "feed_url": "https://mymy-us.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Tim Y"
    },
    "items": [
        {
            "id": "https://mymy-us.github.io/the-1000-per-minute-nightmare-line-stoppages-and-the-air-freight-trap.html",
            "url": "https://mymy-us.github.io/the-1000-per-minute-nightmare-line-stoppages-and-the-air-freight-trap.html",
            "title": "The $1,000 Per Minute Nightmare: Line Stoppages &amp; The Air Freight Trap",
            "summary": "Topic: Crisis Management &amp; Supply Chain Strategy The Scenario: A quality defect is found. All inventory at the customer and your warehouse is&hellip;",
            "content_html": "<p><strong>Topic:</strong> Crisis Management &amp; Supply Chain Strategy<br><strong>The Scenario:</strong> A quality defect is found. All inventory at the customer and your warehouse is quarantined (useless). You are at Zero.</p><h3 id=\"part-1-the-cost-of-silence\">Part 1: The Cost of Silence</h3>\n<p>In the automotive industry, a “Line Down” situation is the ultimate failure.<br>Production lines are continuous. If one station stops, the whole factory stops.</p><ul>\n<li><strong>The Fine:</strong> Penalties often range from <strong>$1,000 to $10,000 per minute</strong>.</li>\n<li><strong>The Logistics:</strong> Even if you have the part in your hand at the gate, it might take 20 minutes just to walk through a massive plant (like Tesla or Daimler-Benz) to reach the line. That walk alone costs $20,000+ in fines.</li>\n</ul>\n<h3 id=\"part-2-the-math-of-the-death-spiral\">Part 2: The Math of the “Death Spiral”</h3>\n<p>When inventory hits zero, most new engineers think: “I just need to rush parts there today.”<br>Wrong. You are facing a <strong>Pipeline Problem</strong>.</p><p><strong>The Example:</strong></p><ul>\n<li><strong>Customer Demand:</strong> 10 parts/day.</li>\n<li><strong>Your Max Capacity:</strong> 12 parts/day.</li>\n<li><strong>Transit Time (Ocean):</strong> 30 days.</li>\n</ul>\n<p>If you produce 12 parts today, you must Air Freight them immediately to keep the line running tomorrow.<br><strong>But you can’t stop there.</strong><br>Because the cheaper option (Ocean Freight) takes 30 days, you must Air Freight your daily production <strong>every single day for 30 days</strong> until the first boat shipment arrives.</p><p><strong>The Result:</strong> You are paying premium freight for a whole month. This usually costs more than <strong>50% of the total failure cost</strong>. It wipes out the profit margin for the entire year.</p><h3 id=\"part-3-the-solution-postponement-localization--tooling\">Part 3: The Solution (Postponement, Localization &amp; Tooling)</h3>\n<p>How do we prevent this without spending a fortune?<br>We cannot always move the whole factory from a low-cost country (like China or Vietnam) to the US. Labor is too expensive.</p><p>The answer is <strong>Strategic Postponement</strong> (or Near-shoring).</p><p><strong>1. The “Final Assembly” Node</strong><br>Keep the complex, labor-intensive fabrication in the low-cost country.<br>Move the final, simple steps (packaging, labeling, light assembly) to a location near the customer (e.g., a US subsidiary or a Mexico border facility).</p><ul>\n<li><strong>Routine:</strong> Ship semi-finished parts via cheap Ocean Freight to the local node.</li>\n<li><strong>Crisis:</strong> If a defect is found, your inventory is already local. You can purge, rework, or finish new parts in <strong>hours</strong>, not weeks.</li>\n</ul>\n<p><strong>2. The Forward Stocking Location (3PL)</strong><br>If you can’t build a factory, rent a warehouse.<br>Use a Third-Party Logistics (3PL) provider near the customer to hold 2 weeks of “Safety Stock.”</p><ul>\n<li><strong>Lean Counter-point:</strong> Yes, Lean says inventory is waste.</li>\n<li><strong>Business Reality:</strong> Paying for 2 weeks of storage is “Waste.” But paying for 4 weeks of Air Freight is “Disaster.” Pick the cheaper waste.</li>\n</ul>\n<p> <strong>3. Redundant Tooling (The Backup Plan)</strong>\n If you cannot move assembly, you must have <strong>Redundant Tooling</strong>.<br>Don’t keep all your molds/dies in one factory. If a mold breaks or a quality issue is tied to a specific machine, you need a backup set of tooling ready to run at a different location immediately.</p><h3 id=\"the-takeaway\">The Takeaway</h3>\n<p>Supply Chain optimization isn’t just about the “lowest piece price.”<br>It is about <strong>Recovery Speed</strong>.<br>If your factory is 30 days away from your customer, you are one quality spill away from bankruptcy. <strong>Shorten the distance.</strong></p>",
            "author": {
                "name": "Tim Y"
            },
            "tags": [
                   "The Lean Toolkit",
                   "Supply Chain Optimization"
            ],
            "date_published": "2025-09-09T17:37:00+08:00",
            "date_modified": "2026-02-19T17:37:56+08:00"
        },
        {
            "id": "https://mymy-us.github.io/ppap-its-not-just-paperwork-its-your-legal-shield.html",
            "url": "https://mymy-us.github.io/ppap-its-not-just-paperwork-its-your-legal-shield.html",
            "title": "PPAP: It’s Not Just Paperwork, It’s Your Legal Shield",
            "summary": "Topic: The True Purpose of PPAP (Production Part Approval Process) The Academic View: PPAP demonstrates that a supplier can meet manufacturing requirements at&hellip;",
            "content_html": "<p><strong>Topic:</strong> The True Purpose of PPAP (Production Part Approval Process)<br><strong>The Academic View:</strong> PPAP demonstrates that a supplier can meet manufacturing requirements at the quoted production rate.<br><strong>The Reality:</strong> PPAP is a <strong>Legal Contract</strong>. It is the “Constitution” of your product.</p><p>Here is why you need to treat it like a weapon, not a checklist.</p><h3 id=\"1-the-shield-protecting-your-company\">1. The Shield: Protecting Your Company</h3>\n<p>Once the customer signs the <strong>PSW (Part Submission Warrant)</strong>, the rules are frozen.</p><p><strong>The Scenario:</strong><br>You are six months into mass production. The customer complains that the surface texture is “too rough” or the color is “slightly off.”</p><p><strong>The Defense:</strong><br>You pull out the approved PPAP and the “Master Sample” (the physical part they signed).</p><ul>\n<li><strong>If your current parts match the Master Sample:</strong> You are safe. The customer agreed to this standard. If they want to change it now, <strong>they must pay for it</strong>.</li>\n<li><strong>If you don’t have a signed PPAP:</strong> The customer can change their mind daily, and you have to pay for the rework.</li>\n</ul>\n<p><strong>Key Lesson:</strong> The signed PSW protects you from the customer’s changing opinions.</p><h3 id=\"2-the-trap-the-cycle-time-lie\">2. The Trap: The “Cycle Time” Lie</h3>\n<p>This is where Lean Engineers get burned.<br>In the PPAP, you document your <strong>Cycle Time</strong> (e.g., 60 seconds per part).</p><ul>\n<li><strong>Do not cheat here.</strong></li>\n<li>Do not run the machine slow just to get good parts for the sample.</li>\n</ul>\n<p>If you PPAP at 60 seconds but run Mass Production at 45 seconds to make more money, you have committed a <strong>Process Violation</strong>. If quality issues appear later, the customer will void your approval because you are running a different process than the one they approved.</p><h3 id=\"3-the-warning-unapproved-changes\">3. The Warning: Unapproved Changes</h3>\n<p>This is the “Third Rail”—touch it and you die.</p><p>If you change anything in the process after the PPAP is signed, you must tell the customer.</p><ul>\n<li>Changing a cutting tool brand? <strong>Notify them.</strong></li>\n<li>Moving the machine to a different spot on the floor? <strong>Notify them.</strong></li>\n<li>Reducing inspection frequency? <strong>Notify them.</strong></li>\n</ul>\n<p>If you make a change without approval (even if it makes the part better), and a recall happens:</p><ol>\n<li><strong>You are liable.</strong> The lawyers will see you didn’t follow the PPAP.</li>\n<li><strong>You lose your certification (IATF 16949).</strong></li>\n<li><strong>Your company faces massive fines.</strong></li>\n</ol>\n<h3 id=\"the-takeaway\">The Takeaway</h3>\n<p>Don’t copy-paste your PPAP documents just to get it done.</p><ul>\n<li><strong>Be Honest:</strong> Only promise a cycle time and tolerance you can actually hit every day.</li>\n<li><strong>Be Strict:</strong> Once it is signed, the factory floor must follow it exactly.</li>\n</ul>\n<p><strong>Treat the PPAP like a court testimony. Because one day, it might be the only thing standing between you and a million-dollar fine.</strong></p>",
            "author": {
                "name": "Tim Y"
            },
            "tags": [
                   "The Lean Thinking"
            ],
            "date_published": "2025-09-07T17:02:00+08:00",
            "date_modified": "2026-02-19T17:04:19+08:00"
        },
        {
            "id": "https://mymy-us.github.io/the-two-halves-of-your-lean-job-and-why-the-second-half-is-harder.html",
            "url": "https://mymy-us.github.io/the-two-halves-of-your-lean-job-and-why-the-second-half-is-harder.html",
            "title": "The Two Halves of Your Lean Job (And Why the Second Half is Harder)",
            "summary": "Topic: The Reality of a Lean Engineer’s Role The Trap: Thinking your job is just “fixing things.” If you ask a professor what&hellip;",
            "content_html": "<p><strong>Topic:</strong> The Reality of a Lean Engineer’s Role<br><strong>The Trap:</strong> Thinking your job is just “fixing things.”</p><p>If you ask a professor what a Lean Engineer does, they’ll say: “Continuous Improvement.”<br>If you ask me, I’ll tell you the job is actually two distinct battles:</p><ol>\n<li><strong>The Attack:</strong> Continuously Eliminating Waste.</li>\n<li><strong>The Defense:</strong> Sustaining the Gains.</li>\n</ol>\n<p>Most new grads crush the first part and fail the second. Here is why.</p><hr>\n<h3 id=\"phase-1-the-maverick-the-attack\">Phase 1: The Maverick (The Attack)</h3>\n<p>This is the fun part. You are the detective.</p><p>You walk onto the floor, clipboard in hand, looking for Shingo’s <strong>7 Wastes</strong> (Defects, Overproduction, Waiting, etc.) plus the deadliest one: <strong>The Waste of Human Talent/Ideas.</strong></p><p>In this phase, you can be a <strong>Maverick</strong>. You can run the data, identify the bottleneck, and design a fix all by yourself. You are the hero with the spreadsheet.</p><p><strong>The result:</strong> You save the company money. You feel like a genius.</p><hr>\n<h3 id=\"phase-2-the-politician-the-defense\">Phase 2: The Politician (The Defense)</h3>\n<p>This is where the “Introvert Tax” hits hard.</p><p>You improved the process. Great. Now, how do you make sure the operators don’t go back to the old way the second you leave the room?</p><p><strong>The “Paper Shield” is Weak</strong><br>In school, they teach you to update the documentation:</p><ul>\n<li>Control Plans</li>\n<li>Standard Operating Procedures (SOPs)</li>\n<li>Publishing via the PLM (Product Lifecycle Management) system</li>\n</ul>\n<p><strong>The Reality:</strong> Documents are passive. They live on servers. To sustain change, you need <strong>Active Enforcement</strong>:</p><ol>\n<li><strong>Visual Management:</strong> Don’t just write a rule; put tape on the floor or a shadow board on the wall. Make it impossible to ignore.</li>\n<li><strong>LPA (Layered Process Audits):</strong> If management doesn’t check it, operators won’t do it.</li>\n<li><strong>Gemba Walks:</strong> You need to be seen on the floor, verifying the fix.</li>\n</ol>\n<p>But even with these tools, you need <strong>Influence</strong>.</p><hr>\n<h3 id=\"the-owner-mindset\">The “Owner” Mindset</h3>\n<p>To survive Phase 2, you need to drop the “I’m just a new grad” attitude.</p><p>You need to walk into the Kaizen project with absolute, unwavering confidence. You need the attitude of:</p><blockquote>\n<p>“I am the Subject Matter Expert. Nobody knows this data better than\nme.”</p></blockquote>\n<p>It sounds arrogant? Good.<br>If you are leading a change, you are the <strong>de facto leader</strong> in that room.</p><ul>\n<li><strong>Don’t</strong> sit in the back corner of the meeting.</li>\n<li><strong>Don’t</strong> be afraid of the Production Manager.</li>\n<li><strong>Do</strong> speak first. Frame the problem. Own the solution.</li>\n<li><strong>Do</strong> actively seek helps from your own department.</li>\n</ul>\n<h3 id=\"how-to-win-the-turf-war\">How to Win the “Turf War”</h3>\n<p>You cannot order people from other departments to listen to you. You have no authority over them.</p><p>You have to use <strong>“The Borrowed Sword.”</strong></p><ol>\n<li><strong>Find the Department Head:</strong> The person who actually owns the staff you are trying to change.</li>\n<li><strong>Sell the Benefit (WIIFM):</strong> Don’t tell them “It’s Lean.” Tell them, “This change will save your team 20 hours of overtime a month.”</li>\n<li><strong>Get the Endorsement:</strong> Once the Department Head sees the benefit, ask them to announce it.</li>\n</ol>\n<p>When the boss says, “We are doing this,” the team follows. You are just the architect; let the Department Head be the enforcer.</p><h3 id=\"the-takeaway\">The Takeaway</h3>\n<p><strong>Phase 1 (Fixing)</strong> requires IQ.<br><strong>Phase 2 (Sustaining)</strong> requires EQ (Emotional Intelligence) and Guts.</p><p>Don’t just be a smart engineer. Be a loud one.</p>",
            "author": {
                "name": "Tim Y"
            },
            "tags": [
                   "The Lean Thinking"
            ],
            "date_published": "2025-09-07T16:46:00+08:00",
            "date_modified": "2026-02-19T16:47:09+08:00"
        },
        {
            "id": "https://mymy-us.github.io/the-art-of-de-escalation-saving-money-and-face-2.html",
            "url": "https://mymy-us.github.io/the-art-of-de-escalation-saving-money-and-face-2.html",
            "title": "De-escalation: The Ultimate Mindset to Solve a Complaint",
            "summary": "Topic: Handling Customer Complaints The Academic View: “The Voice of the Customer is sacred. Whatever they ask for, do it.” The Reality: The&hellip;",
            "content_html": "<p><strong>Topic</strong>: Handling Customer Complaints\n<strong>The Academic View</strong>: “The Voice of the Customer is sacred. Whatever they ask for, do it.”\n<strong>The Reality</strong>: The customer’s “wants” are a bottomless pit that will bankrupt you.</p><h3 id=\"the-golden-rule\">The Golden Rule</h3>\n<p>In Cantonese, there is a saying that perfectly describes the life of a Quality Engineer:</p><div style=\"text-align: center;\"> <img loading=\"lazy\" src=\"大事化小，小事化無.jpg\" alt=\"大事化小，小事化無\" width=\"400\" data-is-external-image=\"true\"> </div>\n\n<p>Translation: “Make big problems small, and make small problems disappear.”</p><p>This is the art of <span style=\"color: #920D14;\"><em><strong>De-escalation</strong></em></span>.</p><h3 id=\"the-trap-the-perfect-solution\">The Trap: “The Perfect Solution”</h3>\n<p>When a defect happens, the customer (usually an SQE - Supplier Quality Engineer) naturally panics. They demand the moon: 100% third-party sorting, brand new tooling, air freight, and a 50-page report.</p><p>If you say “Yes” to everything, you fail.</p><ul>\n<li><strong>The Cost</strong>: Your company eats the bill for sorting and rework.</li>\n<li><strong>The Precedent</strong>: You teach the customer that they can bully you every time.</li>\n</ul>\n<h3 id=\"the-psychology-of-your-counterpart\">The Psychology of Your Counterpart</h3>\n<p>To win, you have to understand who you are talking to. The SQE on the other side isn’t evil. They are just having a really bad day:</p><ol>\n<li><strong>Their Production Team</strong> is yelling at them because the line stopped.</li>\n<li><strong>Their Boss</strong> is asking for a report.</li>\n<li><strong>They are scared</strong> they can’t handle it.</li>\n</ol>\n<p>Key Insight: If they feel like they can’t handle the issue, they will <em><strong>Escalate</strong></em>.\nEscalation = Management gets involved = Trust goes down = Future business is lost.</p><p>Your job isn’t just to fix the part. It is to <strong>make the SQE feel safe</strong> so they don’t hit the panic button.</p><h3 id=\"the-playbook-how-to-de-escalate\">The Playbook: How to De-escalate</h3>\n<p> <strong>Internal Rule #1:</strong>\n<strong>Never lie to yourself.</strong> Internally, you must find the true Root Cause, fix the process, and update the control plan. If you don’t fix it, the problem comes back, and you die.</p><p><strong>External Rule #2:</strong><br><strong>Filter the noise.</strong> Once the internal fix is solid, your communication strategy changes based on the severity.</p><p><span style=\"font-size: 0.8em;\"><strong>Scenario A: The “Small” Thing (Low Risk/Low FMEA score)</strong></span></p><ul>\n<li>The Situation: A minor cosmetic defect or a one-off glitch.</li>\n<li>The Goal: Make it disappear (“let it go”).</li>\n<li>The Move: Leverage your relationship. Show them the data.</li>\n</ul>\n<blockquote>\n<p>“Hey, looking at the FMEA, the risk is negligible. We’ve already\nimplemented [Fix X] internally so it won’t happen again. Let’s treat\nthis as an isolated incident. No need for third-party sorting.”</p></blockquote>\n<p><span style=\"font-size: 0.8em;\"><strong>Scenario A: The “Small” Thing (Low Risk/Low FMEA score)</strong></span></p><ul>\n<li>The Situation: It’s bad.</li>\n<li>The Goal: Make it small.</li>\n<li>The Move: Provide an “Easy Button.”<ul>\n<li>Don’t let them panic about air freight or line-down.</li>\n<li>Give them a containment plan immediately that makes them look good to their boss.</li>\n</ul>\n</li>\n</ul>\n<blockquote>\n<p>“We have a containment team ready. Here is the immediate clean point.\nYou don’t need to stop the line; we have you covered.”</p></blockquote>\n<h3 id=\"lean-corner-why-this-is-technical-not-just-political\">Lean Corner: Why this is Technical, not just Political</h3>\n<p>You might think, “Tim, isn’t this just playing politics?”<br>No. This is <strong>Lean Manufacturing</strong>.</p><p>One of the deadly wastes in Lean is <strong>Over-processing</strong> (doing more work than the customer actually needs).</p><ul>\n<li><strong>Reactive Engineering:</strong> The customer yells -&gt; You panic -&gt; You spend $10k on air freight for a $50 issue. <strong>(Waste)</strong></li>\n<li><strong>Lean Engineering:</strong> You analyze the risk -&gt; You prove the process is safe -&gt; You ship standard ground. <strong>(Value)</strong></li>\n</ul>\n<p>De-escalation isn’t about hiding problems. It’s about Confidence. <strong>Don’t let panic create waste.</strong>\n<strong>Fix the part. Manage the panic. Save the money.</strong></p>",
            "author": {
                "name": "Tim Y"
            },
            "tags": [
                   "The Lean Toolkit",
                   "Quality Engineering"
            ],
            "date_published": "2025-09-06T16:03:00+08:00",
            "date_modified": "2026-02-19T16:36:17+08:00"
        }
    ]
}
